DataProcessors/ЛБ_ПросмотрПеречней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_ПросмотрПеречней</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛБ_ПереченьНежелательныхЛицДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПереченьНежелательныхЛицДокументы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПеречня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ПереченьНежелательныхЛицАдреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПереченьНежелательныхЛицАдреса</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПеречня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ПереченьНежелательныхЛицДрНаименования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПереченьНежелательныхЛицДрНаименования</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТехническоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПеречня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГодРождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЛБ_ПросмотрПеречней/Forms/ФормаПросмотра/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("ИД") Тогда
		Отказ = Истина;
	КонецЕсли;
	ИД = Параметры.ИД; 
	ВидПеречня = Параметры.ВидПеречня; 
	ДатаПеречня = Параметры.ДатаПеречня; 
	ФИО = Параметры.Наименование;   
	МестоРождения = Параметры.МестоРождения; 
	ДатаРождения = Параметры.ДатаРождения;  
	ГодРождения = Параметры.ГодРождения;
	ДатаРожденияСтрока = ?(НЕ ДатаРождения = Дата(1,1,1), Формат(ДатаРождения, "ДФ=dd.MM.yyyy"), Строка(ГодРождения));
	ДатаВключения = Параметры.ДатаВключения;
	Статус = Параметры.Статус; 
	СтрокаСтатус = СокрЛП(Статус) + ?(ЗначениеЗаполнено(ДатаВключения), " " + Формат(ДатаВключения, "ДФ=dd/MM/yy"), "");	
	Элементы.ДекорацияСтатус.Заголовок = СтрокаСтатус;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИД", ИД);
	Запрос.УстановитьПараметр("ВидПеречня", ВидПеречня);
	Запрос.УстановитьПараметр("ДатаПеречня", ДатаПеречня);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПереченьНежелательныхЛицДокументы.ДокументНаименование КАК ДокументНаименование,
	               |	ЛБ_ПереченьНежелательныхЛицДокументы.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ПереченьНежелательныхЛицДокументы.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ПереченьНежелательныхЛицДокументы.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ПереченьНежелательныхЛицДокументы.ДокументДатаВыдачи КАК ДокументДатаВыдачи
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПереченьНежелательныхЛицДокументы КАК ЛБ_ПереченьНежелательныхЛицДокументы
	               |ГДЕ
	               |	ЛБ_ПереченьНежелательныхЛицДокументы.ВидПеречня = &ВидПеречня
	               |	И ЛБ_ПереченьНежелательныхЛицДокументы.ДатаПеречня = &ДатаПеречня
	               |	И ЛБ_ПереченьНежелательныхЛицДокументы.ИД = &ИД"; 
	ТаблицаДокументовЗапрос = Запрос.Выполнить().Выгрузить(); 
	Для каждого Стр Из ТаблицаДокументовЗапрос цикл   
		НоваяСтр = ТаблицаДокументы.Добавить();
		НоваяСтр.ТипДокумента = Стр.ДокументНаименование;
		Док = "";
		Док = Док + ?(ПустаяСтрока(Стр.ДокументСерия), "", ?(ПустаяСтрока(Док), "", " ") + Стр.ДокументСерия); 
		Док = Док + ?(ПустаяСтрока(Стр.ДокументНомер), "", ?(ПустаяСтрока(Док), "", " ") + Стр.ДокументНомер); 
		Док = Док + ?(ПустаяСтрока(Стр.ДокументКемВыдан), "", ?(ПустаяСтрока(Док), "", " ") + Стр.ДокументКемВыдан); 
		Док = Док + ?(ПустаяСтрока(Стр.ДокументДатаВыдачи), "", ?(ПустаяСтрока(Док), "", " ") + Формат(Стр.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy"));
		НоваяСтр.Документ = Док;
	КонецЦикла;	
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПереченьНежелательныхЛицАдреса.Адрес КАК Адрес,
	               |	ЛБ_ПереченьНежелательныхЛицАдреса.ТипАдреса КАК ТипАдреса
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПереченьНежелательныхЛицАдреса КАК ЛБ_ПереченьНежелательныхЛицАдреса
	               |ГДЕ
	               |	ЛБ_ПереченьНежелательныхЛицАдреса.ВидПеречня = &ВидПеречня
	               |	И ЛБ_ПереченьНежелательныхЛицАдреса.ДатаПеречня = &ДатаПеречня
	               |	И ЛБ_ПереченьНежелательныхЛицАдреса.ИД = &ИД";
	ТаблицаАдресовЗапрос = Запрос.Выполнить().Выгрузить(); 
	Для каждого Стр Из ТаблицаАдресовЗапрос цикл   
		НоваяСтр = ТаблицаАдреса.Добавить(); 
		НоваяСтр.ТипАдреса = Стр.ТипАдреса;
		НоваяСтр.Адрес = Стр.Адрес;
	КонецЦикла;    
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПереченьНежелательныхЛицДрНаименования.Наименование КАК Наименование
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПереченьНежелательныхЛицДрНаименования КАК ЛБ_ПереченьНежелательныхЛицДрНаименования
	               |ГДЕ
	               |	ЛБ_ПереченьНежелательныхЛицДрНаименования.ВидПеречня = &ВидПеречня
	               |	И ЛБ_ПереченьНежелательныхЛицДрНаименования.ДатаПеречня = &ДатаПеречня
	               |	И ЛБ_ПереченьНежелательныхЛицДрНаименования.ИД = &ИД";
	ТаблицаДрЗапрос = Запрос.Выполнить().Выгрузить(); 
	Для каждого Стр Из ТаблицаДрЗапрос цикл   
		НоваяСтр = ТаблицаДрНаименования.Добавить(); 
		НоваяСтр.Наименование = Стр.Наименование;
	КонецЦикла;

КонецПроцедуры
